app/views/users/show.html.erb

<ul>
<% @user.orders.each do |order| %>
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 6]]

  <ul>
    <% order.order_items.each do |order_item| %>
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 272]]