app/views/orders/_shopping_cart.html.erb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 29]]
---
<ul>
  <% current_order.order_items.each do |item| %>