app/controllers/categories_controller.rb

  def show
    @categories = Category.all
---
SELECT "categories".* FROM "categories"