app/controllers/dashboard_controller.rb

  def index
    redirect_to root_path unless self.admin?
    dash_badge
    @orders = Order.all.select(&:user_id)
    @categories = Category.all
    @drinks = Drink.all
---
SELECT "orders".* FROM "orders"
SELECT "categories".* FROM "categories"
SELECT "drinks".* FROM "drinks"