app/controllers/drinks_controller.rb

  def index
    @drinks = Drink.search(params[:search]).sort_by
    @categories = Category.all
---
SELECT "drinks".* FROM "drinks" WHERE (name LIKE '%coffee%')
SELECT "categories".* FROM "categories"

  def create
    @drink = Drink.new(drink_params)

    respond_to do |format|
      if @drink.save
---
INSERT INTO "drinks" ("category_id", "created_at", "description", "name", "price", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def set_drink
      @drink = Drink.find(params[:id])
---
SELECT "drinks".* FROM "drinks" WHERE "drinks"."id" = $1 ORDER BY "drinks"."id" ASC LIMIT 1  [["id", 10]]