app/controllers/order_items_controller.rb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."drink_id" = 10 AND "order_items"."order_id" = 29 LIMIT 1
UPDATE "order_items" SET "quantity" = $1, "updated_at" = $2 WHERE "order_items"."id" = 5  [["quantity", 2], ["updated_at", Thu, 14 Nov 2013 04:45:49 UTC +00:00]]
---
  def create
    @order_item = OrderItem.find_or_initialize_by(drink_id: params[:drink_id], order_id: @order.id)
      @order_item.quantity += 1
    if @order_item.save

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 29]]
---
  def update
    @order_item = OrderItem.find( params[:id])