app/views/categories/_form.html.erb

SELECT "categories".* FROM "categories"
---
      <%= f.input :category do %>
        <%= f.select :image_url, Category.all.map { |r| r.image_url } %>