app/views/categories/index.html.erb

  <ul class='<%= category.drink_type %>'>
    <% category.drinks.each do |drink| %>
---
SELECT "drinks".* FROM "drinks" WHERE "drinks"."category_id" = $1  [["category_id", 1]]